#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

          - "*",
          + "https://bcmohmaid--maidqa.my.salesforce.com/*",
          + "https://bcmohmaid--maiduat.my.salesforce.com/*",
        ]
        # (22 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.MAID.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = "abbcb27d-054a-4160-9e46-1cc25a389129"
      + default_scopes = [
          + "email",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.MAID.module.client-roles.keycloak_role.ROLES["MAiD-Analyst"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MAiD-Analyst"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.MAID.module.client-roles.keycloak_role.ROLES["MAiD-Manager-1"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MAiD-Manager-1"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.MAID.module.client-roles.keycloak_role.ROLES["MAiD-Manager-2"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MAiD-Manager-2"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.MAID.module.client-roles.keycloak_role.ROLES["MAiD-Manager-3"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MAiD-Manager-3"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.MAID.module.client-roles.keycloak_role.ROLES["MAiD-Manager-4"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MAiD-Manager-4"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.MAID.module.client-roles.keycloak_role.ROLES["MAiD-System-Administrator"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "MAiD-System-Administrator"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-maid"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-maid"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-maid"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-maid"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-maid"
      + service_account_user_id = "97d87125-7804-4830-bbef-00bc58b178d0"
    }

Plan: 19 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ahoplock, Action: `pull_request`*